{
    "Ejercicio1": "Escribir un algoritmo en el cual se consulte al usuario que ingrese ¿cómo está el día de hoy? (soleado, nublado, lloviendo). A continuación, mostrar por pantalla un mensaje que indique “El día de hoy está ...”, completando el mensaje con el dato que ingresó el usuario.",
    "Ejercicio2": "Conocido el número en matemática PI π, pedir al usuario que ingrese el valor del radio de una circunferencia y calcular y mostrar por pantalla el área y perímetro. Recuerde que para calcular el área y el perímetro se utilizan las siguientes fórmulas: <br> <strong>area = PI * radio2</strong> <br> <strong>perimetro = 2 * PI * radio</strong>",
    "Ejercicio3": "Escriba un programa en donde se pida la edad del usuario. Si el usuario es mayor de edad se debe mostrar un mensaje indicándolo.",
    "Ejercicio4": "Realiza un programa que sólo permita introducir los caracteres 'S' y 'N'. Si el usuario ingresa alguno de esos dos caracteres se deberá de imprimir un mensaje por pantalla que diga 'CORRECTO', en caso contrario, se deberá imprimir 'INCORRECTO'.",
    "Ejercicio5": "Construir un programa que simule un menú de opciones para realizar las cuatro operaciones aritméticas básicas (suma, resta, multiplicación y división) con dos valores numéricos enteros. El usuario, además, debe especificar la operación con el primer carácter de la operación que desea realizar: ‘S' o ‘s’ para la suma, ‘R’ o ‘r’ para la resta, ‘M’ o ‘m’ para la multiplicación y ‘D’ o ‘d’ para la división.",
    "Ejercicio6": "Realizar un programa que, dado un número entero, visualice en pantalla si es par o impar. En caso de que el valor ingresado sea 0, se debe mostrar “el número no es par ni impar”.",
    "Ejercicio7": "Escriba un programa en el cual se ingrese un valor límite positivo, y a continuación solicite números al usuario hasta que la suma de los números introducidos supere el límite inicial.",
    "Ejercicio8": "Escribir un programa que lea números enteros hasta teclear 0 (cero). Al finalizar el programa se debe mostrar el máximo número ingresado, el mínimo, y el promedio de todos ellos.",
    "Ejercicio9": "Realizar un programa que pida una frase y el programa deberá mostrar la frase con un espacio entre cada letra. La frase se mostrara así: H o l a. Nota: recordar el funcionamiento de la función Substring().",
    "Ejercicio10": "Escribir una función flecha que reciba una palabra y la devuelva al revés.",
    "Ejercicio11": "Escribir una función que reciba un String y devuelva la palabra más larga. <br>String Ejemplo: “Guia de JavaScript”<br>Resultado esperado : “JavaScript”",
    "Ejercicio12": "Escribir una función flecha de JavaScript que reciba un argumento y retorne el tipo de dato.",
    "Ejercicio13": "Crear un objeto persona, con las propiedades nombre, edad, sexo ('H' hombre, 'M' mujer, 'O' otro), peso y altura. A continuación, muestre las propiedades del objeto JavaScript.",
    "Ejercicio14": "Crear un objeto libro que contenga las siguientes propiedades: ISBN, Título, Autor, Número de páginas. Crear un método para cargar un libro pidiendo los datos al usuario y luego informar mediante otro método el número de ISBN, el título, el autor del libro y el numero de páginas.",
    "Ejercicio15": "Escribe un programa JavaScript para calcular el área y el perímetro de un objeto Círculo con la propiedad radio. Nota: Cree dos métodos para calcular el área y el perímetro. El radio del círculo lo proporcionará el usuario.",
    "Ejercicio16": "Realizar un programa que rellene dos vectores al mismo tiempo, con 5 valores aleatorios y los muestre por pantalla.",
    "Ejercicio17": "Realizar un programa que elimine los dos últimos elementos de un array. Mostrar el resultado.",
    "Ejercicio18": "A partir del siguiente array: var valores = [true, 5, false, 'hola', 'adios', 2]:<br>a) Determinar cual de los dos elementos de texto es mayor.<br>b) Utilizando exclusivamente los dos valores booleanos del array, determinar los operadores necesarios para obtener un resultado true y otro resultado false.<br>c) Determinar el resultado de las cinco operaciones matemáticas realizadas con los dos elementos numéricos.",
    "Ejercicio19": "Realizar un programa en Java donde se creen dos arreglos: el primero será un arreglo A de 50 números reales, y el segundo B, un arreglo de 20 números, también reales. El programa deberá inicializar el arreglo A con números aleatorios y mostrarlo por pantalla. Luego, el arreglo A se debe ordenar de menor a mayor y copiar los primeros 10 números ordenados al arreglo B de 20 elementos, y rellenar los 10 últimos elementos con el valor 0.5. Mostrar los dos arreglos resultantes: el ordenado de 50 elementos y el combinado de 20.78.",
    "Ejercicio20": "Realizar un programa que obtenga la siguiente matriz [[3], [6], [9], [12], [15]] y devuelve y muestre el siguiente array [6, 9, 12, 15, 18].",
    "Ejercicio21": "Escribir un programa para obtener un array de las propiedades de un objeto Persona. Las propiedades son nombre, edad, sexo ('H' hombre, 'M' mujer, 'O' otro), peso y altura.",
    "Ejercicio22": "Escribir un programa de JavaScript que al clickear un botón muestre un mensaje aelección.",
    "Ejercicio23": "Resalte todas las palabras de más de 8 caracteres en el texto del párrafo (con un fondo amarillo, por ejemplo)",
    "Ejercicio24": "Escribir un programa de JavaScript que a través de un formulario calcule el radio de un circulo y lo muestre en el HTML.",
    "Ejercicio25": "Escriba una función de JavaScript para obtener los valores de Nombre y Apellido del siguiente formulario"
}